
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，测试输入的整数能否被3，5，或3与5同时整除。
可能输出如下，请直接复制粘贴使用：
        能被3但不能被5整除 
        能被5整除但不能被3整除
        能被3和5同时整除
        既不能被3整除也不能被5整除

注意：使用样张数据测试代码时，程序输出必须和样张完全相同

-------------------------------------------------------*/
#include <iostream>
using namespace std; 
int main()
{ 
/**********Program**********/        
	int a;
	cin>>a;
	if(a%3==0)
	{
		if(a%5==0)
		{
			cout<<a<<"能被3和5同时整除"<<endl;
		}
		else
		{
			cout<<a<<"能被3但不能被5整除"<<endl;
		}
	}
	else
	{
		if(a%5==0)
		{
			cout<<a<<"能被5整除但不能被3整除"<<endl;
		}
		else
		{
			cout<<a<<"既不能被3整除也不能被5整除"<<endl;
		}
	}
		return 0;

/**********  End  **********/
}
