
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：有一个数组，内放10个整数，要求找出最小的数和它的下标,
然后把它和数组中最前面的元素对换。
输出结果见图：样张.JPG
-------------------------------------------------------*/
#include <iostream>
#include <cmath>
using namespace std;
void main()
{        
        int a[10];
        int i,min,j,temp;//min为最小值,j为最小值下标
        cout<<"请输入10个数\n";
 for(i=0;i<10;i++)
                cin>>a[i];
/**********Program**********/
     
/**********  End  **********/
}
