
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：请编写程序，将任意长度的5进制数转换为十进制数,并输出转换结果

输出结果见图：样张.JPG

要求与输出样张一样才能得到满分。

-------------------------------------------------------*/
#include <iostream>
#include <cmath> 
using namespace std; 

int main()
{
/**********Program**********/
	int a,b=0,c;
	cout<<"输入要转换的五进制数";
	cin>>a;
	for(int i=1;i<=100;i++)
	{
		c=(a%int((pow(10.0,i))))/(pow(10.0,i-1.0));
		b+=c*pow(5.0,i-1.0);
	}
	cout<<"五进制数"<<a<<"对应的十进制数为"<<b<<endl;
/**********  End  **********/

return 0;
        }