
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

输入一串字符串，以"#"号结束，输出其中的大写字母个数、小写字母个数和数字个数。

-------------------------------------------------------*/
#include <iostream>

using namespace std;

void main()
{
    int nA = 0, na=0,n0 = 0;
    char ch;

    cin.get(ch);
    while(ch != '#')
    { 
           
    /**********Program**********/
        
   

    /**********  End  **********/

        cin.get(ch);
    }
    cout<<"\n大写字母个数="<<nA<<endl;
        cout<<"\n小写字母个数="<<na<<endl;
        cout<<"\n数字个数="<<n0<<endl;

}