

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：参看书本例程5.23

  表中依次存储有10种不同的书名，请按实际需要查找是否存有某本书？


输出请参看样张。
为避免因为标点问题出错，输出提示语句请复制以下句子：

    存在，其位置是：
    
    对不起，

    不存在！
    
-------------------------------------------------------*/
#include <iostream>
#include<cstring>
using namespace std;
int main()
{
        char name[10][21]={"计算机基础","编译原理","算法基础",
                "计算机原理","高等数学","线性代数","离散数学",
                "大学物理","大学英语","大学英语听力"};

        char  searchname[21]; //要查找的书名
        cout<<"请输入要查找的书名:";
        cin.getline(searchname,20);  
        
        /**********Program**********/
        
        /**********  End  **********/
                return 0; 
}
