
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：

编程求出所有的“水仙花数”。所谓“水仙花数”是指一个3位数，

其中各位数字的立方和等于该数本身，例如153就是一个“水仙花数”，

因为153=1*1*1+5*5*5+3*3*3。 

要求与输出样张一样才能得到满分。
-------------------------------------------------------*/

#include <iostream>
#include <cmath>
using namespace std;
int main(){


/**********Program**********/
	int a,b,c,d;
	for(a=1;a<=9;a++)
	{
		for(b=0;b<=9;b++)
		{
			for(c=0;c<=9;c++)
			{
				d=100*a+10*b+c;
				if(d==a*a*a+b*b*b+c*c*c)
					cout<<d<<"是水仙花数"<<endl;
			}
		}
	}
/**********  End  **********/
        return 0;
}
