
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个算命程序，可以预测前世（本题内容纯属虚构）

算命方法：
将某人的出生年月日加起来,如果结果不是一位数，就再相加,
如果相加之后还是一位数以上的话，就再相加，直到变成一位数.
例如：1994 年3 月20 日出生的人
1+9+9+4+0+3+2+0=28
28>9：需再计算2+8=10
10>9：需再计算1+0=1

计算结果对应的输出信息为

计算结果=1 输出 "1你上辈子是神仙"
计算结果=2 输出 "2你上辈子是皇帝或国王"
计算结果=3 输出 "3你上辈子是贵族",
计算结果=4 输出 "4你上辈子是读书人"
计算结果=5 输出 "5你上辈子是有钱人"
计算结果=6 输出 "6你上辈子是穷人"
计算结果=7 输出 "7你上辈子是非人类"
计算结果=8 输出 "8你上辈子是演员"
计算结果=9 输出 "9你上辈子是出家人"

输出格式见样张。
-------------------------------------------------------*/
#include <iostream>
using namespace std;
int main()
{
        /**********Program**********/


        /**********  End  **********/
}
