

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，从键盘输入某一字符的ASCII码，程序会在屏幕上输出该字符和ASCII码。
输出格式请参看样张。

请直接复制使用输入提示

  "请输入一个不大于127的正整数>>"
  "字符"
  "ASCII码"

注意：使用样张数据测试代码时，程序输出必须和样张完全相同

-------------------------------------------------------*/
#include <iostream>
using namespace std; 
int main()
{ 
/**********Program**********/        
	int ac;
	char c;
	cout<< "请输入一个不大于127的正整数>>";
	cin>>ac;
	c=ac;
	cout<<"字符"<<c<<endl;
	cout<<"ASCII码"<<ac<<endl;
	return 0;
/**********  End  **********/
}