

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，将大写字母转换为小写字母
输出格式请参看样张。

输入提示请直接复制使用
   
     "请输入一个大写英文字符"

     "字符"

     "的小写形式为"

注意：使用样张数据测试代码时，程序输出必须和样张完全相同

-------------------------------------------------------*/
#include <iostream>
using namespace std; 
int main()
{ 
/**********Program**********/        
      char lc,uc;
	  cout<<"请输入一个大写英文字符";
	  cin>>uc;
	  lc=uc-'A'+'a';
	  cout<<"字符"<<uc<<"的小写形式为"<<lc<<endl;
	  return 0;
/**********  End  **********/
}

 