
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：
编写程序要求按行顺序为一个5×5的二维数组赋1～25的自然数，
然后输出并计算该数组的左下三角元素之和。
程序运行结果见附图。
-------------------------------------------------------*/
#include <iostream>
using namespace std;
void main(void)
{
        int a[5][5],i,j, sum=0;
       
/**********Program**********/
		int m=1;
		for(i=0;i<5;i++)
		{
			for(j=0;j<5;j++)
			{
				a[i][j]=m;
				m++;
			}
		}
		for(i=0;i<5;i++) 
		{
            for(j=0;j<=i;j++)
			{
				sum+=a[i][j];
			}
		}
/**********  End  **********/
                for(i=0;i<5;i++) {
                        for(j=0;j<=i;j++)
                                cout<<a[i][j]<<'\t';
                        cout<<'\n';
                }
                cout<<"数组左下三角的元素之和"<<sum<<endl;
}