
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：分段函数说明见图：公式.JPG,请完善程序

输出结果见图：样张.JPG

要求与输出样张一样才能得到满分。
-------------------------------------------------------*/
#include <iostream>
#include <cmath>
using namespace std;

int main()
{
      
/**********Program**********/
	double x,y;
	cout<<"输入x的值";
	cin>>x;
	if(x<=0)
	{
		y=cos(double (fabs(x)));
	}
	else if(x<=38)
	{
		y=2*x+2;
	}	
	else if(x<67)
	{
		y=pow(x,2.0);
	}	
	else
	{
		y=(4*pow(x,2.0)+1)/x;
	}
	cout<<"函数值为"<<y<<endl;
/**********  End  **********/
      
        return 0;
}
