

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：根据输入的球半径，分别计算球的表面积、体积（圆周率=3.1415）,
并输出计算结果。输出请参看样张。

注意： 使用样张数据测试代码时，程序输出必须和样张完全相同

要求：
1.圆周率用符号常量的形式实现，否则不得分。

2.球体半径必须定义为int类型

3.使用字符串常量作为操作提示 

    输入提示示例如下，请直接复制粘贴使用

        "请输入球体半径:"
        "的球体体积为"
        "的球体表面积为"

4.输出计算结果时，小数位数为4位（使用setprecision函数和setiosflags函数）

-------------------------------------------------------*/
#include <iostream>
#include <iomanip>
using namespace std; 
/**********Program**********/
#include <cmath>
int main()
{
	int r;
	double S,V;
	double const PI=3.1415;
	cout<<"请输入球体半径:";
	cin>>r;
	S=4*pow(r,2.0)*PI;
	V=((4*pow(r,3.0))/3)*PI;
	cout<<setiosflags(ios::fixed)<<setprecision(4);
	cout<<"半径"<<r<<"的球体体积为"<<V<<endl;
	cout<<"半径"<<r<<"的球体表面积为"<<S<<endl;
	return 0;
}
/**********  End  **********/
 
