
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：
请编写程序，输入一个整数和一个数字后，能够统计出该整数中包含这一数字的个数。

输入575765和5
输出5的个数为3

输出结果见图：样张.JPG

要求与输出样张一样才能得到满分。

-------------------------------------------------------*/
#include <iostream>
using namespace std; 

int main()
{
/**********Program**********/
	int a,b,c=0,d=0,e;
	cin>>a;
	cin>>b;
	e=a;
	for(int i=0;a>0;i++)
	{	

		c=a%10;
		if(c==b)
			d++;
		a/=10;

	}
	cout<<e<<"中"<<b<<"的个数为"<<d<<endl;
/**********  End  **********/
return 0;
        }