

/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写一个程序，可以对长度为n(n<=20)的有序升序数列array
进行折半查找

输出请参看样张。

输出示例如下，请复制粘贴使用

"找到@下标是"
"没有找到#"
-------------------------------------------------------*/
#include <iostream>
using namespace std;
int main()
{

        int const max=20;
                int array[max];
                int n;//数组长度
                 cout<<"请输入数组长度:";
                cin>>n;
                 cout<<"请输入数组:";
                for(int i=0;i<n;i++) cin>>array[i];
        int a;//待查找的数
        cout<<"请输入要查找的数:";
        cin>>a;
        /**********Program**********/

    /**********  End  **********/
    return 0; 
}