
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：
输入3个整数，按从大到小的顺序输出.

输出结果见图：样张.JPG
注意：输出的数据使用 '\t' 隔开 。


要求与输出样张一样才能得到满分。
-------------------------------------------------------*/
#include <iostream>
using namespace std;
int main(){
      

/**********Program**********/
int x,y,z;
cout<<"输入三个整数";
cin>>x>>y>>z;
if(x<y&&y<z&&x<z){cout<<z<<"\t"<<y<<"\t"<<x<<"\t"<<endl;}
else if(x<y&&x<z&&z<y){cout<<y<<"\t"<<z<<"\t"<<x<<"\t"<<endl;}
else if(y<x&&x<z&&y<z){cout<<z<<"\t"<<x<<"\t"<<y<<"\t"<<endl;}
else if(y<x&&z<y&&z<x){cout<<x<<"\t"<<y<<"\t"<<z<<"\t"<<endl;}
else if(z<x&&z<y&&x<y){cout<<y<<"\t"<<x<<"\t"<<z<<"\t"<<endl;}
else {cout<<z<<"\t"<<y<<"\t"<<x<<"\t"<<endl;}
/**********  End  **********/
 return 0;      

}