
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：编写程序，从键盘输入一个字符，然后在屏幕上输出该字符开头的连续3个字符以及对应ASCII码。
输出格式请参看样张。

请直接复制使用输入提示

  "请输入一个字符>>"
  "字符"
  "ASCII码"

注意：使用样张数据测试代码时，程序输出必须和样张完全相同,字符和ＡＳＣＩＩ码之间的空格是２个。
      上下行对齐方式不能使用直接输入空格的方式对齐。

-------------------------------------------------------*/
#include <iostream>
#include <iomanip>
using namespace std; 
int main()
{ 
/**********Program**********/        
	char a,b,c;
	int x,y,z;
	cout<<"请输入一个字符>>";
	cin>>a;
	b=char(a+1);
	c=char(a+2);
	x=int(a);
	y=int(b);
	z=int(c);
	cout<<"字符" <<"  "<<"ASCII码"<<endl;
	cout<<setw(4)<<a<<setw(7)<<x<<endl;
	cout<<setw(4)<<b<<setw(7)<<y<<endl;
	cout<<setw(4)<<c<<setw(7)<<z<<endl;
/**********  End  **********/
return 0;
}