
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入两个字符串s1、s2，s1和s2中不包含空格字符。
检查判断s2串是否是s1串的子串。
如果是，输出s2在s1中的开始位置，如果s2不是s1的子串，则输出-1

注意:检测时对子串中的字符不重复使用,参看样张1.jpeg

输出请参看样张。

-------------------------------------------------------*/
#include <iostream>
using namespace std;
int main()
{
        char s1[100];
        char s2[100];
        
        /**********Program**********/
    cin>>s1;
    cin>>s2;

    int k,flag;
    int i=0,n=0;
    while(s1[i]!='\0')
    {
        k=i;
        flag=1;
        for(int j=0;s2[j]!='\0';j++)
        {
            if(s1[j]!=s2[j])
            {
                flag=0;
                break;
            }
        }
        if(flag==1)
        {
            cout<<i<<endl;
            n++;
            i=k;

        }
        else 
            i++;
    }
    if(n==0)
        cout<<-1<<endl;

    /**********  End  **********/
    return 0; 
}