
/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：从键盘输入两个字符串s1、s2，s1和s2中不包含空格字符。
检查判断s2串是否是s1串的子串。
如果是，输出s2在s1中的开始位置，如果s2不是s1的子串，则输出-1

注意:检测时对子串中的字符不重复使用,参看样张1.jpeg

输出请参看样张。

-------------------------------------------------------*/
#include <iostream>
using namespace std;
int main()
{
        char s1[100];
        char s2[100];
        
        /**********Program**********/
    cin>>s1;
    cin>>s2;
    int flag,k;
    int n=0;
    int i=0;
    while (s1[i]!='\0') //当读取到s1末尾时结束循环
    {
        k=i;//k用于s1与s2比较
        flag=1;//flag用于判断s1从k开始的子串是否与s2相同，默认相同
        for (int j=0;s2[j]!='\0';++j)//读到字符串s2末尾结束循环
        {
            if (s1[k]!=s2[j]){
                flag=0;
                break;//字符串不匹配，结束循环，重新匹配下一个子串
            }
            k++;
        }
        if (flag){
            cout<<i<<endl;
            n++;
            i=k;//输出并重置i
        }
        else
            i++;
    }
    if (n==0)
        cout<<-1<<endl;
    /**********  End  **********/
    return 0; 
}